; domain
(define (domain world)
    (:requirements :strips :typing :negative-preconditions)
    (:types hero place item)
    (:predicates
        (at ?where ?what)
        (path ?p1 ?p2)
        (waterpath ?p1 ?p2)
        (own ?i)

        (craftable ?b ?w)
        (craftable_med ?b ?i1 ?i2)
        (craftable_big ?b ?i1 ?i2 ?i3)

        (canswim ?onwhat)
        (canwork ?where)
        (buy ?what ?where)
        (stealable ?what ?where)
        (sell ?what ?where)

        (isalko ?i)
        (iscocaine ?c)
        (grandpa ?p)
        (ismap ?m)
        (isgg ?gg)
        (isgc ?gc)
        (isgi ?gi)
        (isskin ?i)
        (isfrigate ?f)
        (iscaravel ?c)
        (isboat ?b)
        (isflowers ?f)
        (isring ?r)
        
        (alittledrunk)
        (drunk)
        (alkodep)

        (bath ?p)
        (bank ?p)
        (seaplace ?p)
        (bearplace ?p)
        (beerplace ?p)
        (academyplace ?p)
        (pirateplace ?p)
        (pirateproblem ?p)
        (treasureplace ?p)
        (weddingplace ?p)
        (girlhome ?p)
        (smugglerplace ?p)
        (police ?p)

        (Captain)
        (Strong)
        (Smuggler)

        (goodcontacts)
        (badcontacts)
        (criminalrecord)
        (weddingready)

        (HAPPINESS)


    )

    (:action move
        :parameters (?hero - hero ?from - place ?to - place)
        :precondition (and            
            (at ?from ?hero)
            (path ?from ?to)
        )
        :effect (and
            (at ?to ?hero)
            (not (at ?from ?hero))
        )
    )
    (:action swim
        :parameters (?hero - hero ?from - place ?to - place ?i - item)
        :precondition (and            
            (at ?from ?hero)
            (waterpath ?from ?to)
            (not(pirateproblem ?from))
            (own ?i)
            (canswim ?i)
        )
        :effect (and
            (at ?to ?hero)
            (not (at ?from ?hero))
        )
    )
    (:action collect_item
        :parameters (?s - hero ?p - place ?i - item)
        :precondition (and
		      (at ?p ?s)
		      (at ?p ?i )
              (not(pirateproblem ?p))
	    )
        :effect (and 
              (own ?i) 
        ) 
    )
    (:action fightbear
        :parameters (?s - hero ?p - place ?i - item)
        :precondition (and
		      (at ?p ?s)
		      (bearplace ?p)
              (isskin ?i)
	    )
        :effect (and 
              (own ?i)
              (not(bearplace ?p))
              (Strong) 
        ) 
    )
    (:action fight_alittledrunk
        :parameters (?s - hero ?p - place)
        :precondition (and
		      (at ?p ?s)
		      (beerplace ?p)
              (alittledrunk)
	    )
        :effect (and 
              (Strong) 
        ) 
    )
    (:action fight_drunk
        :parameters (?s - hero ?p - place)
        :precondition (and
		      (at ?p ?s)
		      (beerplace ?p)
              (drunk)
	    )
        :effect (and 
              (Strong) 
        ) 
    )
    (:action buy_item
        :parameters (?s - hero ?p - place ?hi - item ?wi - item)
        :precondition (and
		      (at ?p ?s)
		      (buy ?wi ?p )
              (own ?hi)
              (isgg ?hi)
	    )
        :effect (and 
              (own ?wi)
              (not(own ?hi))
        ) 
    )
    (:action sell_item
        :parameters (?s - hero ?p - place ?hi - item ?gc - item)
        :precondition (and
		      (at ?p ?s)
		      (sell ?hi ?p )
              (own ?hi)
              (isgc ?gc)
	    )
        :effect (and 
              (own ?gc)
              (not(own ?hi))
        ) 
    )
    (:action contribution
        :parameters (?s - hero ?p - place ?gg - item ?gc - item)
        :precondition (and
		      (at ?p ?s)
		      (bank ?p)
              (own ?gg)
              (isgg ?gg)
              (isgc ?gc)
	    )
        :effect (and 
              (own ?gc)
              (not(own ?gg))
              (goodcontacts)
        ) 
    )
    (:action invest
        :parameters (?s - hero ?p - place ?gc - item ?gi - item)
        :precondition (and
		      (at ?p ?s)
		      (bank ?p)
              (own ?gc)
              (isgc ?gc)
              (isgi ?gi)
	    )
        :effect (and 
              (own ?gi)
              (not(own ?gc))
              (goodcontacts)
        ) 
    )
    (:action beer_for_all
        :parameters (?s - hero ?p - place ?hi - item ?gc - item)
        :precondition (and
		      (at ?p ?s)
		      (beerplace ?p)
              (own ?gc)
              (isgc ?gc)
	    )
        :effect (and 
              (goodcontacts)
              (not (own ?gc))
        ) 
    )
    (:action craft
        :parameters (?b - item ?w - item )
        :precondition (and
              (own ?w)
              (craftable ?b ?w)
	    )
        :effect (and 
              (own ?b)
              (not(own ?w))
        ) 
    )
    (:action stayalittledrunk
        :parameters (?i - item )
        :precondition(and
            (own ?i)
            (isalko ?i)
            
        )
        :effect (and
            (alittledrunk)
            (not(own ?i))
        )    
    )
    (:action staydrunk
        :parameters (?i - item )
        :precondition(and
            (own ?i)
            (isalko ?i)
            (alittledrunk)
        )
        :effect (and
            (drunk)
            (not(alittledrunk))
            (not(own ?i))
        )    
    )
    (:action staydep
        :parameters (?i - item )
        :precondition(and
            (own ?i)
            (isalko ?i)
            (drunk)
        )
        :effect (and
            (alkodep)
            (not(own ?i))
        )    
    )
    (:action staysober1
        :parameters (?s - hero ?p - place )
        :precondition(and
            (drunk)
            (at ?p ?s)
            (bath ?p)
        )
        :effect (and
            (not(drunk))
            (not(alittledrunk))
        )    
    )
    (:action staysober2
        :parameters (?s - hero ?p - place )
        :precondition(and
            (alittledrunk)
            (at ?p ?s)
            (bath ?p)
        )
        :effect (and
            (not(drunk))
            (not(alittledrunk))
        )    
    )
    (:action craft_big
        :parameters (?b - item ?i1 - item ?i2 - item ?i3 - item)
        :precondition (and
              (own ?i1)
              (own ?i2)
              (own ?i3)
              (craftable_big ?b ?i1 ?i2 ?i3)
	    )
        :effect (and 
              (own ?b)
              (not(own ?i1))
              (not(own ?i2)) 
              (not(own ?i3))
        ) 
    )
    (:action craft_med
        :parameters (?b - item ?i1 - item ?i2 - item)
        :precondition (and
              (own ?i1)
              (own ?i2)
              (craftable_med ?b ?i1 ?i2 )
	    )
        :effect (and 
              (own ?b)
              (not(own ?i1))
              (not(own ?i2)) 
        ) 
    )
    (:action work
        :parameters(?s - hero ?p - place ?i - item)
        :precondition(and
                (canwork ?p)
                (isgg ?i)
                (at ?p ?s)
        )
        :effect (and
            (own ?i)
        )
    )
    (:action stealitem
        :parameters(?s - hero ?p - place ?i - item)
        :precondition(and
                (stealable ?i ?p)
                (at ?p ?s)
        )
        :effect (and
            (own ?i)
            (criminalrecord)
        )
    )
    (:action stay_captain
        :parameters(?s - hero ?p - place ?gc - item)
        :precondition(and
                (academyplace ?p)
                (at ?p ?s)
                (own ?gc)
                (not (criminalrecord))
                (isgc ?gc)
        )
        :effect (and
            (not(own ?gc))
            (Captain)
        )
    )
    (:action pay_bail
        :parameters(?s - hero ?p - place ?i - item)
        :precondition(and
                (at ?p ?s)
                (police ?p)
                (isgg ?i)
                (own ?i)
                (criminalrecord)
        )
        :effect (and
            (not (own ?i))
            (not (criminalrecord))
        )
    )
    (:action erase_criminal_record
        :parameters(?s - hero ?p - place)
        :precondition(and
                (at ?p ?s)
                (police ?p)
                (criminalrecord)
        )
        :effect (and
            (not (drunk))
            (alittledrunk)
            (not (criminalrecord))
        )
    )
    (:action granny
        :parameters(?s - hero ?p - place ?a - item ?m - item)
        :precondition(and
                (grandpa ?p)
                (at ?p ?s)
                (own ?a)
                (isalko ?a)
                (ismap ?m)
        )
        :effect (and
            (own ?m)
            (not (own ?a))
            (badcontacts)
        )
    )
    (:action smugglers
        :parameters(?s - hero ?p - place ?gi - item)
        :precondition(and
                (smugglerplace ?p)
                (at ?p ?s)
                (own ?gi)
                (isgi ?gi)
        )
        :effect (and
            (Smuggler)
        )
    )
    (:action pirate_bad_fight
        :parameters(?s - hero ?p - place ?gc - item ?gg - item ?gi - item ?c - item ?f - item ?b - item)
        :precondition(and
                (at ?p ?s)
                (pirateplace ?p)
                (pirateproblem ?p)
                (not(Strong))
                (isgg ?gg)
                (isgc ?gc)
                (isgi ?gi)
                (isfrigate ?f)
                (iscaravel ?c)
                (isboat ?b)
        )
        :effect (and
            (not (own ?gg))
            (not (own ?gc))
            (not (own ?gi))
            (not (own ?f))
            (not (own ?c))
            (own ?b)
            (Strong)
        )
    )
    (:action pirate_contact
        :parameters(?s - hero ?p - place)
        :precondition(and
                (at ?p ?s)
                (pirateplace ?p)
                (pirateproblem ?p)
                (badcontacts)
        )
        :effect (and
            (alittledrunk)
            (not(drunk))
            (not(pirateproblem ?p))
        )
    )
    (:action pirate_good_fight
        :parameters(?s - hero ?p - place ?gc - item ?gg - item ?gi - item ?c - item ?f - item ?b - item)
        :precondition(and
                (at ?p ?s)
                (pirateplace ?p)
                (Strong)
                (iscaravel ?c)
                (isgg ?gg)
                (isgc ?gc)
                (isgi ?gi)
                (isfrigate ?f)
                (isboat ?b)
                (own ?c)
        )
        :effect (and
            (own ?gg)
            (own ?gc)
            (own ?gi)
            (own ?f)
            (own ?c)
            (own ?b)
            (not(pirateplace ?p))
            (not(pirateproblem ?p))
        )
    )
    (:action woo
        :parameters(?s - hero ?p - place)
        :precondition(and
                (at ?p ?s)
                (girlhome ?p)
                (Strong)
        )
        :effect (and
            (weddingready)
        )
    )
    (:action get_cocaine
        :parameters(?s - hero ?p - place ?m - item ?c - item)
        :precondition(and
                (at ?p ?s)
                (treasureplace ?p)
                (ismap ?m)
                (own ?m)
                (iscocaine ?c)
        )
        :effect (and
            (own ?c)
        )
    )
    (:action wedding
        :parameters(?s - hero ?p - place ?r - item ?f - item)
        :precondition(and
                (at ?p ?s)
                (weddingready)
                (weddingplace ?p)
                (not(criminalrecord))
                (own ?r)
                (isring ?r)
                (own ?f)
                (isflowers ?f)
                (goodcontacts)
                (not (alittledrunk))
                (not(drunk))
                (not(alkodep))
        )
        :effect (and
            (HAPPINESS)
        )
    )
    (:action stay_admiral
        :parameters(?s - hero ?p - place ?a - place)
        :precondition(and
                (at ?a ?s)
                (academyplace ?a)
                (seaplace ?p)
                (not(pirateplace ?p))
                (Captain)
                (not (alittledrunk))
                (not(drunk))
                (not(alkodep))
        )
        :effect (and
            (HAPPINESS)
        )
    )
    (:action rocknroll
        :parameters(?c - item ?f - item ?gi - item)
        :precondition(and
                (own ?c)
                (iscocaine ?c)
                (isfrigate ?f)
                (own ?f)
                (isgi ?gi)
                (own ?gi)
                (alkodep)
                (Smuggler)
        )
        :effect (and
            (HAPPINESS)
        )
    )


)

; problem
(define (problem to_be_happy)
    (:domain world)
    (:requirements :strips :typing  :negative-preconditions)
    (:objects sailor - hero
              port river forest island sea bar city academy beacon - place
              wood coconuts pearl boat bearskin frigate caravel goldgrain goldcoin goldignot alko cocaine map flowers ring - item )
    (:init
        (path port river)   (path river port)
        (path port city)   (path city port)
        (path city academy)   (path academy city)
        (path port bar)   (path bar port)
        (path river forest) (path forest river)
        (waterpath port sea)   (waterpath sea port)
        (waterpath port beacon)   (waterpath beacon port)
        (waterpath sea beacon)  (waterpath beacon sea)
        (waterpath sea island)  (waterpath island sea)

        (at port sailor)
        (at forest wood)
        (at forest flowers)
        (at island coconuts)
        (at island wood)
        (at sea pearl)
        (seaplace sea)
    

        (not(own wood))
        (not(own boat))
        (not(own caravel))
        (not(own map))

        (isgg goldgrain)
        (isgc goldcoin)
        (isgi goldignot)

        (craftable boat wood)
        (craftable_med ring goldignot pearl)
        (craftable_big frigate goldgrain wood boat)
        (craftable_big caravel goldcoin wood boat)

        (canswim boat)
        (canswim frigate)
        (canswim caravel)


        (buy alko bar)
        (sell bearskin port)
        (sell coconuts port)
        (stealable boat river)
        (stealable goldcoin city)
        (canwork port)
        (canwork river)
        (bath river)
        (bath sea)
        (police city)


        (isalko alko)
        (ismap map)
        (iscocaine cocaine)
        (isskin bearskin)
        (isfrigate frigate)
        (iscaravel caravel)
        (isboat boat)
        (isflowers flowers)
        (isring ring)
        (grandpa forest)
        (bearplace forest)
        (beerplace bar)
        (pirateplace sea)
        (pirateproblem sea)
        (bank city)
        (academyplace academy)
        (treasureplace island)
        (girlhome beacon)
        (smugglerplace port)
        (weddingplace island)
        
        (not(alittledrunk))
        (not (drunk))
        (not(alkodep))
        (not(goodcontacts))
        (not(badcontacts))
        (not(criminalrecord))
        (not(weddingready))
        (not(Strong))
        (not(Smuggler))

        (not(HAPPINESS))
    )   
    (:goal 
        (and
          (HAPPINESS)
        )
    )
)

; plan
1. (move sailor port river)
   deleted: (at port sailor)
   added: (at river sailor)
   goals met: 0 of 1
2. (move sailor river forest)
   deleted: (at river sailor)
   added: (at forest sailor)
   goals met: 0 of 1
3. (fightbear sailor forest bearskin)
   deleted: (bearplace forest)
   added: (own bearskin) (strong)
   goals met: 0 of 1
4. (collect_item sailor forest wood)
   added: (own wood)
   goals met: 0 of 1
5. (craft boat wood)
   deleted: (own wood)
   added: (own boat)
   goals met: 0 of 1
6. (collect_item sailor forest wood)
   added: (own wood)
   goals met: 0 of 1
7. (move sailor forest river)
   deleted: (at forest sailor)
   added: (at river sailor)
   goals met: 0 of 1
8. (move sailor river port)
   deleted: (at river sailor)
   added: (at port sailor)
   goals met: 0 of 1
9. (sell_item sailor port bearskin goldcoin)
   deleted: (own bearskin)
   added: (own goldcoin)
   goals met: 0 of 1
10. (craft_big caravel goldcoin wood boat)
   deleted: (own goldcoin) (own wood) (own boat)
   added: (own caravel)
   goals met: 0 of 1
11. (swim sailor port sea caravel)
   deleted: (at port sailor)
   added: (at sea sailor)
   goals met: 0 of 1
12. (pirate_good_fight sailor sea goldcoin goldgrain goldignot caravel frigate boat)
   deleted: (pirateplace sea) (pirateproblem sea)
   added: (own goldgrain) (own goldcoin) (own goldignot) (own frigate) (own boat)
   goals met: 0 of 1
13. (swim sailor sea port caravel)
   deleted: (at sea sailor)
   added: (at port sailor)
   goals met: 0 of 1
14. (move sailor port city)
   deleted: (at port sailor)
   added: (at city sailor)
   goals met: 0 of 1
15. (move sailor city academy)
   deleted: (at city sailor)
   added: (at academy sailor)
   goals met: 0 of 1
16. (stay_captain sailor academy goldcoin)
   deleted: (own goldcoin)
   added: (captain)
   goals met: 0 of 1
17. (stay_admiral sailor sea academy)
   added: (happiness)
   goals met: 1 of 1
